{
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential",
      "layers": [
        {
          "class_name": "Dense",
          "config": {
            "units": 128,
            "activation": "relu",
            "name": "dense_1"
          }
        }
      ]
    }
  },
  "weightsManifest": [
    {
      "paths": ["model.weights.bin"],
      "weights": [
        {
          "name": "dense_1/kernel",
          "shape": [128, 64],
          "dtype": "float32"
        }
      ]
    }
  ]
}
